<a href="https://colab.research.google.com/github/iamainankhan/Ainan-Khan/blob/main/pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#**Pandas**

In [6]:
import pandas as pd

In [8]:
df=pd.read_csv("Employee.csv")

In [ ]:
print(df.head())

   Education  JoiningYear       City  PaymentTier  Age  Gender EverBenched  \
0  Bachelors         2017  Bangalore            3   34    Male          No
1  Bachelors         2013       Pune            1   28  Female          No
2  Bachelors         2014  New Delhi            3   38  Female          No
3    Masters         2016  Bangalore            3   27    Male          No
4    Masters         2017       Pune            3   24    Male         Yes

   ExperienceInCurrentDomain  LeaveOrNot
0                          0           0
1                          3           1
2                          2           0
3                          5           1
4                          2           1

In [ ]:
data={
    "Name":["Khan","Ainan","Ahmed"],
    "Age":[19,21,22],
    "City":['Mumbai','Delhi','Ranchi']
}
df=pd.DataFrame(data)

In [ ]:
print(df)

    Name  Age    City
0   Khan   19  Mumbai
1  Ainan   21   Delhi
2  Ahmed   22  Ranchi

In [ ]:
df.to_csv("new_data.csv",index=False)

In [ ]:
import pandas as pd

In [ ]:
df=pd.read_csv("/Employee.csv")

In [ ]:
print(df.head(10))

   Education  JoiningYear       City  PaymentTier  Age  Gender EverBenched  \
0  Bachelors         2017  Bangalore            3   34    Male          No
1  Bachelors         2013       Pune            1   28  Female          No
2  Bachelors         2014  New Delhi            3   38  Female          No
3    Masters         2016  Bangalore            3   27    Male          No
4    Masters         2017       Pune            3   24    Male         Yes
5  Bachelors         2016  Bangalore            3   22    Male          No
6  Bachelors         2015  New Delhi            3   38    Male          No
7  Bachelors         2016  Bangalore            3   34  Female          No
8  Bachelors         2016       Pune            3   23    Male          No
9    Masters         2017  New Delhi            2   37    Male          No

   ExperienceInCurrentDomain  LeaveOrNot
0                          0           0
1                          3           1
2                          2           0
3                          5           1
4                          2           1
5                          0           0
6                          0           0
7                          2           1
8                          1           0
9                          2           0

In [ ]:
print(df.tail())

      Education  JoiningYear       City  PaymentTier  Age  Gender EverBenched  \
4648  Bachelors         2013  Bangalore            3   26  Female          No
4649    Masters         2013       Pune            2   37    Male          No
4650    Masters         2018  New Delhi            3   27    Male          No
4651  Bachelors         2012  Bangalore            3   30    Male         Yes
4652  Bachelors         2015  Bangalore            3   33    Male         Yes

      ExperienceInCurrentDomain  LeaveOrNot
4648                          4           0
4649                          2           1
4650                          5           1
4651                          2           0
4652                          4           0

In [ ]:
print("Display the info of the dataset")  #summarize the dataset
print(df.info())

Display the info of the dataset
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4653 entries, 0 to 4652
Data columns (total 9 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   Education                  4653 non-null   object
 1   JoiningYear                4653 non-null   int64
 2   City                       4653 non-null   object
 3   PaymentTier                4653 non-null   int64
 4   Age                        4653 non-null   int64
 5   Gender                     4653 non-null   object
 6   EverBenched                4653 non-null   object
 7   ExperienceInCurrentDomain  4653 non-null   int64
 8   LeaveOrNot                 4653 non-null   int64
dtypes: int64(5), object(4)
memory usage: 327.3+ KB
None

In [10]:
data={
    "Name":["Khan","Ainan","Ahmed","Ayan","Shaikh","Faizan","Sheikh","Ansari"],
    "Age":[19,21,22,45,75,35,34,87],
    "Salary":[10000,20000,40000,45000,23000,21000,86000,65000],
    "Performance Score":[6,3,7,5,2,9,5,1]
}
df=pd.DataFrame(data)
print(df)

     Name  Age  Salary  Performance Score
0    Khan   19   10000                  6
1   Ainan   21   20000                  3
2   Ahmed   22   40000                  7
3    Ayan   45   45000                  5
4  Shaikh   75   23000                  2
5  Faizan   35   21000                  9
6  Sheikh   34   86000                  5
7  Ansari   87   65000                  1

In [ ]:
print(df.describe())

             Age        Salary  Performance Score
count   8.000000      8.000000           8.000000
mean   42.250000  38750.000000           4.750000
std    25.650118  25921.585049           2.659216
min    19.000000  10000.000000           1.000000
25%    21.750000  20750.000000           2.750000
50%    34.500000  31500.000000           5.000000
75%    52.500000  50000.000000           6.250000
max    87.000000  86000.000000           9.000000

In [ ]:
print(df.shape)
print(df.columns)

(8, 4)
Index(['Name', 'Age', 'Salary', 'Performance Score'], dtype='object')

In [ ]:
print(df["Name"])  #Select single column

0      Khan
1     Ainan
2     Ahmed
3      Ayan
4    Shaikh
5    Faizan
6    Sheikh
7    Ansari
Name: Name, dtype: object

In [ ]:
print(df[["Name","Salary"]])   #Select multiple columns

     Name  Salary
0    Khan   10000
1   Ainan   20000
2   Ahmed   40000
3    Ayan   45000
4  Shaikh   23000
5  Faizan   21000
6  Sheikh   86000
7  Ansari   65000

In [ ]:
highest_salarries=df[df["Salary"]>25000]  #select on basis of single condition
print("Highest Salary")
print(highest_salarries)

Highest Salary
     Name  Age  Salary  Performance Score
2   Ahmed   22   40000                  7
3    Ayan   45   45000                  5
6  Sheikh   34   86000                  5
7  Ansari   87   65000                  1

In [4]:
filter=df[(df["Salary"]>40000) & (df["Age"]>40)]    #select on basis of multiple condition
print(filter)

NameError: name 'df' is not defined

In [14]:
df["Bonus"]=df["Salary"]*0.1  #Adding a column in dataset
print(df)

     Name  Age  Salary  Performance Score   Bonus
0    Khan   19   10000                  6  1000.0
1   Ainan   21   20000                  3  2000.0
2   Ahmed   22   40000                  7  4000.0
3    Ayan   45   45000                  5  4500.0
4  Shaikh   75   23000                  2  2300.0
5  Faizan   35   21000                  9  2100.0
6  Sheikh   34   86000                  5  8600.0
7  Ansari   87   65000                  1  6500.0

In [24]:
df.insert(0,"Emp_id",[1,2,3,4,5,6,7,8])  #inser column at certain position
print(df)

   Emp_id  Employee Id    Name  Age  Salary  Performance Score   Bonus
0       1            1    Khan   19   10000                  6  1000.0
1       2            2   Ainan   21   20000                  3  2000.0
2       3            3   Ahmed   22   40000                  7  4000.0
3       4            4    Ayan   45   45000                  5  4500.0
4       5            5  Shaikh   75   23000                  2  2300.0
5       6            6  Faizan   35   21000                  9  2100.0
6       7            7  Sheikh   34   86000                  5  8600.0
7       8            8  Ansari   87   65000                  1  6500.0

In [27]:
df.loc[1,"Salary"]=70000  #update single value
print(df)
highest_salary=df[df["Salary"]>69000]
print("Highest Salary")
print(highest_salary)

   Emp_id  Employee Id    Name  Age  Salary  Performance Score   Bonus
0       1            1    Khan   19   10000                  6  1000.0
1       2            2   Ainan   21   70000                  3  2000.0
2       3            3   Ahmed   22   40000                  7  4000.0
3       4            4    Ayan   45   45000                  5  4500.0
4       5            5  Shaikh   75   23000                  2  2300.0
5       6            6  Faizan   35   21000                  9  2100.0
6       7            7  Sheikh   34   86000                  5  8600.0
7       8            8  Ansari   87   65000                  1  6500.0
Highest Salary
   Emp_id  Employee Id    Name  Age  Salary  Performance Score   Bonus
1       2            2   Ainan   21   70000                  3  2000.0
6       7            7  Sheikh   34   86000                  5  8600.0

In [28]:
df["Salary"]=df["Salary"]*1.05 #updating multiple values, increasing by 5%
print(df)

   Emp_id  Employee Id    Name  Age   Salary  Performance Score   Bonus
0       1            1    Khan   19  10500.0                  6  1000.0
1       2            2   Ainan   21  73500.0                  3  2000.0
2       3            3   Ahmed   22  42000.0                  7  4000.0
3       4            4    Ayan   45  47250.0                  5  4500.0
4       5            5  Shaikh   75  24150.0                  2  2300.0
5       6            6  Faizan   35  22050.0                  9  2100.0
6       7            7  Sheikh   34  90300.0                  5  8600.0
7       8            8  Ansari   87  68250.0                  1  6500.0

In [29]:
df.drop(columns=["Performance Score","Age"], inplace=True)  #deleting column
print(df)

   Emp_id  Employee Id    Name   Salary   Bonus
0       1            1    Khan  10500.0  1000.0
1       2            2   Ainan  73500.0  2000.0
2       3            3   Ahmed  42000.0  4000.0
3       4            4    Ayan  47250.0  4500.0
4       5            5  Shaikh  24150.0  2300.0
5       6            6  Faizan  22050.0  2100.0
6       7            7  Sheikh  90300.0  8600.0
7       8            8  Ansari  68250.0  6500.0